// Давайте произведём 5 операций с массивом.
//
//    1 Создайте массив styles с элементами «Джаз» и «Блюз».
//    2 Добавьте «Рок-н-ролл» в конец.
//    3 Замените значение в середине на «Классика». Ваш код для поиска значения в середине должен работать для массивов с любой длиной.
//    4 Удалите первый элемент массива и покажите его.
//    5 Вставьте «Рэп» и «Регги» в начало массива.


// let styles = ['Джас', 'Блюз'];
//
// styles.push('Рок-н-ролл');
//
// styles [1] = 'Классика';
//
// styles.shift();
//
// styles.unshift('Рэп', 'Регги');
//
// console.log(styles)
